[
  {
    "id": 1,
    "title": "Photography Social Networking Application",
    "description": "A social networking app for photographers to share, connect, and interact with photos. It allows account management, photo uploads, comments, and voting, encouraging community engagement. Key features include following favourite users, receiving notifications, and accessing a comprehensive analytics dashboard.",
    "technologies": [
      "React",
      "TypeScript",
      "CodeIgniter",
      "PHP",
      "REST APIs",
      "MySQL"
    ],
    "codeUrl": [
      {
        "label": "Back-end",
        "url": "https://github.com/dominik-deak/photo-social-server"
      },
      {
        "label": "Front-end",
        "url": "https://github.com/dominik-deak/photo-social-client"
      }
    ]
  },
  {
    "id": 2,
    "title": "Traffic Sign Image Classification using a Convolutional Neural Network (~94% accuracy)",
    "description": "A Traffic Sign Image Classification program in a Jupyter Notebook using Tensorflow and Keras, training a Convolutional Neural Network on the \"GTSRB-German Traffic Sign Recognition Benchmark\" dataset with 39,209 images across 3 classes. The model, tested on 12,630 images, achieved ~94% accuracy. I utilised statistical methods for detailed analysis, including accuracy scoring and generating confusion matrices. My approach was informed by extensive research from 5 related studies.",
    "technologies": [
      "Python",
      "Jupyter Notebook",
      "TensorFlow",
      "Keras",
      "Artificial Intelligence",
      "Machine Learning",
      "Convolutional Neural Networks"
    ],
    "codeUrl": [
      {
        "label": "Jupyter Notebook",
        "url": "https://github.com/dominik-deak/applied-ai-cnn"
      }
    ]
  },
  {
    "id": 3,
    "title": "ExerTrack - Al-powered Workout Logger for tracking gym progress",
    "description": " A mobile application designed to support users in managing their fitness journeys by allowing them to log workout sessions through a user-friendly interface. It analyses workout data and predicts future workout performances, enhancing user engagement through aesthetically pleasing charts and graphs that display their workout history.",
    "technologies": [
      "React Native",
      "Node.js",
      "Express.js",
      "MongoDB",
      "TypeScript",
      "Prisma ORM",
      "TensorFlow",
      "Keras",
      "TensorFlow.js"
    ],
    "codeUrl": [
      {
        "label": "Jupyter Notebook",
        "url": "https://github.com/dominik-deak/exertrack-prediction-model"
      },
      {
        "label": "Back-end",
        "url": "https://github.com/dominik-deak/exertrack-server"
      },
      {
        "label": "Front-end",
        "url": "https://github.com/dominik-deak/exertrack-client"
      }
    ]
  },
  {
    "id": 4,
    "title": "Portfolio Website (This website)",
    "description": "A portfolio website, showcasing my professional background. The main page provides an overview of my professional experience, my skill set, and my educational background. A separate page displays my personal projects, and another page has a contact form for inquiries and connections. The site serves as a dynamic CV/resume, offering insight into my capabilities and accomplishments as a software engineer.",
    "technologies": [
      "Next.js",
      "React",
      "TypeScript",
      "Tailwind CSS",
      "React Email",
      "Resend"
    ],
    "codeUrl": [
      {
        "label": "GitHub Repository",
        "url": "https://github.com/dominik-deak/portfolio"
      }
    ]
  }
]
